<template>
  <a href="#/Informatica/">
    <img
      src="../images/OUT.png"
      class="sticky"
      style="height: 30px; width: 30px; float: left; margin: 10px"
    />
  </a>
  <div>
    <center><h1 class="title">Задания по русскому:</h1></center>
    <center>
      <div class="flex flex-wrap justify-center items-center">
        <button
          class="e-button circle"
          v-for="(task, index) in tasks"
          :key="index"
          @click="
            showTask(index);
            limitHeight;
          "
        >
          {{ index + 1 }}
        </button>
      </div>

      <div id="yandex_rtb_R-A-11699635-7" class="sticky-ad; hello"></div>
    </center>
    <div v-if="currentTask !== null">
      <center>
        <div
          v-for="(subTask, subTaskIndex) in tasks[currentTask].subTasks"
          :key="subTaskIndex"
        >
          <div v-html="subTask.question"></div>

          <div
            style="
              background-color: white !important;
              margin: 20px;
              border-width: 1px;
              border-radius: 30px;
              color: black;
            "
            v-if="showAnswer[currentTask][subTaskIndex]"
          >
            <h style="font-size: 17px"
              >Ответ:
              <span
                style="font-size: 17px; color: black !important"
                v-html="subTask.text"
              ></span
            ></h>
            <br />
            <button
              class="butto"
              style="
                background-color: green;
                border-radius: 50px;
                color: white;
                margin: 10px;
                padding: 7px;
                border-color: black;
                border-width: 1.5px;
              "
              @click="toggleAnswer(currentTask, subTaskIndex)"
            >
              Скрыть ответ
            </button>
          </div>
          <div v-else>
            <button
              class="but"
              style="
                background-color: #d41613;
                border-radius: 50px;
                margin: 3px;
                padding: 7px;
                color: white;
              "
              @click="toggleAnswer(currentTask, subTaskIndex)"
            >
              Показать ответ
            </button>
          </div>
        </div>
      </center>
    </div>
  </div>
  <div style="position: sticky" id="yandex_rtb_R-A-11699635-2"></div>
</template>
<script>
export default {
  mounted() {
    // Инициализируем массив showAnswer, скрывая ответы по умолчанию
    this.showAnswer = Array(this.tasks.length).fill(false);
    // Инициализируем вложенные массивы для каждого задания
    this.showAnswer = this.showAnswer.map(() => Array(5).fill(false));
    this.$nextTick(() => {
      const adContainer1 = document.getElementById("yandex_rtb_R-A-11699635-7");
      if (adContainer1) {
        if (!window.yaContextCb) {
          window.yaContextCb = [];
        }
        window.yaContextCb.push(() => {
          Ya.Context.AdvManager.render({
            renderTo: "yandex_rtb_R-A-11699635-7",
            blockId: "R-A-11699635-7",
          });
        });
      } else {
        console.error("Рекламный контейнер 1 не найден в DOM");
      }

      const adContainer2 = document.getElementById("yandex_rtb_R-A-11699635-2");
      if (adContainer2) {
        window.yaContextCb.push(() => {
          Ya.Context.AdvManager.render({
            renderTo: "yandex_rtb_R-A-11699635-2",
            blockId: "R-A-11699635-2",
          });
        });
      } else {
        console.error("Рекламный контейнер 2 не найден в DOM");
      }

      const script = document.createElement("script");
      script.type = "text/javascript";
      script.src = "https://an.yandex.ru/system/context.js";
      script.async = true;
      document.head.appendChild(script);
    });
  },
  data() {
    return {
      tasks: [
        {
          subTasks: [
            {
              question: `
              <center>
              <div  style="background-color:white;margin: 8px;border-radius:20px;margin-bottom:20px">
              <center><strong><h >Вопрос 2 (номера из учебников для подготовки) (номера из учебников для подготовки) </h></strong></center>
                  <p style="color:black !important">Укажите варианты ответов, в которых верно определена грамматическая основа в одном из предложений или в одной из частей сложного предложения текста. Запишите номера ответов.</p><br/>

<p style="color:black;">
1)  полюсы неравноправны (предложение 1)<br/>

2)  он может длиться (предложение 2)<br/>

3)  правда (предложение 3)<br/>

4)  это объясняется (предложение 4)<br/>

5)  условность объясняется (предложение 5)<br/>

 

(1)Хотя диалог обычно противопоставляют монологу, в таком противопоставлении полюсы неравноправны. (2)Диалог  — живая форма общения, он может длиться долго; напротив, монолог  — искусственная форма речи, обычно он длится недолго. (3)Правда, на сцене монолог звучит более естественно, чем в жизни. (4)Это объясняется тем, что, во-⁠первых, сценический монолог предполагает фоном всю пьесу и, во-⁠вторых, сами зрители выступают как бы в роли молчаливого собеседника актёра, произносящего монолог. (5)И всё же известная условность монолога сохраняется и на сцене, чем объясняется его постепенное вытеснение с подмостков: в пьесах нашего времени монолог занимает гораздо более скромное место, чем раньше.</p></div></center>
                `,
              text: '<img  alt="Справка" src="./public/tasks/69.bmp"></img>',
            },

            {
              question: `
              <center>
              <div  style="background-color:white;margin: 8px;border-radius:20px;margin-bottom:20px">
              <center><strong><h style="color:black">Вопрос 2.2</h></strong></center>
                  <p style="color:black">Укажите варианты ответов, в которых верно определена грамматическая основа в одном из предложении или в одной из частей сложного предложения текста. Запишите номера ответов.</p><br/>

<p style="color:black;">
1)  это сочетание (предложение 1)<br/>

2)  движения играют (предложение 2)<br/>

3)  Силы (как) разрушают, (так и) создают (предложение 3)<br/>

4)  равнины возникают (предложение 4)<br/>

5)  Происходит это (предложение 5)<br/>

 

(1)Рельеф Земли  — это сочетание разнообразных неровностей поверхности, как больших, так и маленьких, возникших в результате деятельности внешних и внутренних сил. (2)Важную роль в его образовании играют тектонические движения, сила тяжести, плотность и состав горных пород, деятельность вулканов и текучих вод. (3)Грозные силы природы, приводя в движение прочнейшие скальные массивы, как разрушают их до основания, так и создают новые горы, впадины, ущелья и долины. (4)А на дне океанов возникают огромные равнины, которые со временем покрываются илом и крупными обломками. (5)Происходит это довольно медленно, и всей человеческой жизни не хватит, чтобы заметить изменения поверхности; она как будто дышит, то поднимаясь, то опускаясь, по ней пробегают волны, она лопается от возникших напряжений.</p></div></center>
                `,
              text: '<img  alt="Справка" src="./public/tasks/70.bmp"></img>',
            },
            {
              question: `
              <center>
              <div  style="background-color:white;margin: 8px;border-radius:20px;margin-bottom:20px">
              <center><strong><h >Вопрос 2.3</h></strong></center>
                  <p >Укажите варианты ответов, в которых верно определена грамматическая основа в одном из предложений или в одной из частей сложного предложения текста. Запишите номера ответов.</p><br/>

<p style="color:black;">
1)  В составе есть (предложение 1)<br/>

2)  А.С Пушкин отметил (предложение 2)<br/>

3)  роль играют (предложение 3)<br/>

4)  был понятен (предложение 4)<br/>

5)  способствовал обогащению (предложение 5)<br/>

 

(1)В словарном составе русского языка, кроме лексики исконной, есть и пласт слов заимствованных, то есть пришедших к нам из других языков, славянских и неславянских. (2)Эту восприимчивость нашего языка к включению в свой состав слов из других языков отметил ещё А. С. Пушкин, писавший о русском языке как о «гибком и мощном в своих оборотах и средствах», «переимчивом и общежительном в своём отношении к чужим языкам». (3)Среди слов, заимствованных из славянских языков, особую роль играют старославянизмы  — слова, пришедшие в русский язык из языка древнейших памятников письменности. (4)Старославянский язык (по происхождению древнеболгарский) получил широкое распространение в Древней Руси, так как был в значительной степени понятен русским людям и его усвоение не представляло большой трудности. (5)Он способствовал обогащению словарного состава русского языка.</p></div></center>
                `,
              text: '<img  alt="Справка" src="./public/tasks/71.bmp"></img>',
            },
            {
              question: `
              <center>
              <div  style="background-color:white;margin: 8px;border-radius:20px;margin-bottom:20px">
              <center><strong><h >Вопрос 2.4</h></strong></center>
                  <p >Укажите варианты ответов, в которых верно определена грамматическая основа в одном из предложений или в одной из частей сложного предложения текста. Запишите номера ответов.</p><br/>

<p style="color:black;">
1)  есть жизнь (предложение 1)<br/>

2)  Солнце восходит (и) заходит (предложение 2)<br/>

3)  23 сентября  — (это) начало (предложение 3)<br/>

4)  начинаются (предложение 4)<br/>

5)  начинается день (предложение 5)<br/><br/>

(1)Земля  — третья планета Солнечной системы, это единственная пока известная нам планета, на которой есть жизнь. (2)Она совершает полный оборот вокруг Солнца, как известно, за 365 дней; два раза в году, 21 марта и 23 сентября, Солнце восходит точно на востоке и заходит точно на западе, а день равен ночи. (3)21 марта называют днём весеннего равноденствия: это начало астрономической весны, а 23 сентября  — день осеннего равноденствия: это начало астрономической осени. (4)А когда же начинаются астрономические зима и лето? (5)Астрономическая зима начинается 22 декабря  — самый короткий день зимнего солнцестояния, а астрономическое лето начинается 22 июня  — самый длинный день летнего солнцестояния: в эти дни Солнце появляется летом на северо-⁠востоке, а зимой  — на юго-востоке, заходит летом на северо-⁠западе, а зимой  — на юго-⁠западе.
</p></div></center>
                `,
              text: '<img  alt="Справка" src="./public/tasks/72.bmp"></img>',
            },
          ],
        },
        {
          subTasks: [
            {
              question: `
              <center>
              <div  style="background-color:white;margin: 8px;border-radius:20px;margin-bottom:20px">
              <center><strong><h >Вопрос 3 (номера из учебников для подготовки)</h></strong></center>
                  <p >Укажите варианты ответов, в которых верно определена грамматическая основа в одном из предложений или в одной из частей сложного предложения текста. Запишите номера ответов.</p><br/>
<p>
1)  мышь является (предложение 1)<br/>

2)  тело покрыто (предложение 2)<br/>

3)  поместить волоски (предложение 3)<br/>

4)  размеры соизмеримы (предложение 4)<br/>

5)  можно утверждать (предложение 5)<br/>
<br/>
(1)Морская мышь на самом деле является весьма симпатичным червём размером в несколько сантиметров. (2)Замечательная особенность этого червя состоит в том, что его тело покрыто своего рода бахромой, содержащей множество волосков, которые переливаются всеми цветами радуги. (3)Здесь, так же как и в опале, игра цвета определяется дифракцией света на сложной микроструктуре, и, если поместить волоски морской мыши под электронный микроскоп, становится отчётливо видно их ячеистое строение, напоминающее пчелиные соты. (4)Эта структура отличается удивительной упорядоченностью, а линейные размеры ячеек соизмеримы с длинами волн в диапазоне видимого света. (5)Можно с уверенностью утверждать, что в волосках морской мыши имеется двумерная фотонная среда: из потока света, падающего на волосок перпендикулярно, отражается только красный цвет (красная часть спектра); если же свет падает наклонно, волосок отражает (в зависимости от угла) то жёлтый, то зелёный, то синий цвета, и глазу он предстаёт поочерёдно во всех цветах радуги.</p></div></center>
                `,
              text: '<img  alt="Справка" src="./public/tasks/73.bmp"></img>',
            },
            {
              question: `
              <center>
              <div  style="background-color:white;margin: 8px;border-radius:20px;margin-bottom:20px">
              <center><strong><h >Вопрос 3.2</h></strong></center>
                  <p >Укажите варианты ответов, в которых дано верное утверждение. Запишите номера ответов.

</p><br/>
<p>1)  Предложение 1 сложноподчинённое с последовательным подчинением придаточных.<br/>

2)  Предложение 2 неполное.<br/>

3)  Предложение 3 односоставное, распространённое.<br/>

4)  Предложение 4 простое двусоставное.<br/>

5)  Предложение 5 сложное бессоюзное.<br/>
<br/>
(1)В мировой художественной литературе немало примеров того, как с помощью слова можно описать музыку и те сложные впечатления, которые возникают у слушателя при восприятии музыкального произведения. (2)Одним из таких художников слова являлся Иван Сергеевич Тургенев. (3)Музыкальность, тонкий слух и музыкальный вкус, постоянное пребывание с раннего детства в атмосфере музыки и красоты способствовали глубокому пониманию писателем музыкального искусства и сказались на характере его творчества. (4)Произведения Тургенева в большинстве своём связаны с музыкой. (5)Музыка становится средством характеристики героев, выражением авторской позиции.
</p>
</div></center>
                `,
              text: '<img  alt="Справка" src="./public/tasks/74.bmp"></img>',
            },
            {
              question: `
              <center>
              <div  style="background-color:white;margin: 8px;border-radius:20px;margin-bottom:20px">
              <center><strong><h >Вопрос 3.3</h></strong></center>
                  <p >Укажите варианты ответов, в которых дано верное утверждение. Запишите номера ответов.<br/>
                    1)  Предложение 1 простое двусоставное.<br/>

2)  В предложении 2 содержатся однородные составные именные сказуемые.<br/>

3)  Предложение 3 содержит 2 (две) грамматические основы.<br/>

4)  Предложение 4 осложнено однородными обстоятельствами.<br/>

5)  Предложение 5 сложноподчинённое с придаточным определительным.<br/></p><br/>
<p>(1)Зачем садовод осенью при первых ночных заморозках поджигает разложенные по саду кучи влажного мусора? (2)Осенние ночные заморозки  — это налетающий с севера холодный воздух и открытое небо. (3)Земля теряет накопленное за день тепло в результате конвекции и теплового инфракрасного излучения, и корни деревьев могут промёрзнуть, пока они не укрыты снегом. (4)Дым от костров поднимается невысоко и не сразу опускается на землю. (5)Он расстилается над садом, образуя некое «одеяло», которое препятствует конвекции воздуха и отражает инфракрасное излучение земли над всей площадью сада.</p>
</div></center>
                `,
              text: '<img  alt="Справка" src="./public/tasks/75.bmp"></img>',
            },
            {
              question: `
              <center>
              <div  style="background-color:white;margin: 8px;border-radius:20px;margin-bottom:20px">
              <center><strong><h >Вопрос 3.4</h></strong></center>
                  <p >Укажите варианты ответов, в которых дано верное утверждение. Запишите номера ответов.</p><br/>

<p>1)  Предложение 1 осложнено обстоятельством, выраженным деепричастным оборотом.<br/>

2)  Предложение 2 нераспространённое.<br/>

3)  Предложение 3 сложносочинённое.<br/>

4)  Предложение 4 содержит 5 (пять) грамматических основ.<br/>

5)  Предложение 5 простое, осложнённое однородными сказуемыми.<br/><br/>\

(1)Великие физические открытия XX века стали возможны благодаря применению научного метода познания природы. (2)«Увидеть», «описать», «понять», «применить»  — такими глаголами можно выразить основные составляющие этого метода. (3)Каждый из этапов научной деятельности имеет свои особенности, и не каждый учёный может одинаково успешно освоить все премудрости научного метода. (4)Одним больше нравится наблюдать природные явления, находя в них гармонию, красоту и скрытую целесообразность; другим  — экспериментировать в целях выявления неизвестных закономерностей; третьи создают теории мироздания, объясняющие устройство мира; четвёртые изобретают новые приборы, с помощью которых можно изменить окружающий мир. (5)Так усилиями множества людей разных стран постепенно строится величественное здание науки, которое служит одновременно всем людям на Земле.
</p></div></center>
                `,
              text: '<img  alt="Справка" src="./public/tasks/76.bmp"></img>',
            },
            {
              question: `
              <center>
              <div  style="background-color:white;margin: 8px;border-radius:20px;margin-bottom:20px">
              <center><strong><h >Вопрос 3.5</h></strong></center>
                  <p >Укажите варианты ответов, в которых дано верное утверждение. Запишите номера ответов.</p><br/>
                  <p>
1)  Предложение 1 осложнено обособленным приложением.<br/>

2)  В предложении 2 сказуемое составное глагольное.<br/>

3)  Предложение 3 сложносочинённое.<br/>

4)  Предложение 4 осложнено однородными членами предложения, которые следуют после обобщающего слова.<br/>

5)  Предложение 5 сложное с союзной подчинительной и сочинительной связью.<br/><br/>
(1)Самое большое скопление воды на поверхности Земли  — это Мировой океан. (2)Материки и острова разделяют его на отдельные океаны, проливы, заливы. (3)Постоянные морские течения связывают его в единое целое, но у каждой его части есть свои особенности. (4)В Мировом океане обычно выделяют четыре океана: Тихий, Атлантический, Индийский и Северный Ледовитый. (5)На некоторых картах отмечен ещё один океан  — Южный, который омывает Антарктиду, однако многие учёные отказываются признавать его отдельное существование и обосновывают это целой системой научных доказательств.
</p></div></center>
                `,
              text: '<image src="./public/tasks/77.bmp"></image>',
            },
          ],
        },
        // Добавьте остальные задания с subTasks
        {
          subTasks: [
            {
              question: `
              <center>
              <div  style="background-color:white;margin: 8px;border-radius:20px;margin-bottom:20px">
              <center><strong><h >Вопрос 4 (номера из учебников для подготовки)</h></strong></center>
                  <p >Укажите варианты ответов, в которых даны верные характеристики предложений текста. Запишите номера ответов.<br/>
                    1)  Предложение 1 простое.<br/>

2)  Предложение 2 с параллельным (неоднородным) подчинением придаточных.<br/>

3)  Предложение 3 сложноподчинённое.<br/>

4)  Последняя часть предложения 4  — неопределённо-личное предложение.<br/>

5)  В предложении 5 три грамматических основы.<br/><br/>
(1)Выразительное чтение невозможно без внутренних представлений чтеца, без ярких образов, в противном случае оно будет безжизненным и скучным. (2)Когда мы в жизни произносим слова, мы всегда представляем себе то действие или тот предмет, которые они обозначают. (3)И прежде чем произнести эти слова, мы видим перед собой их содержание. (4)Когда мы рассказываем что-нибудь своим собеседникам, мы постоянно видим «внутренним глазом» всё то, о чём говорим. (5)Когда же слушаем чей-то рассказ, то чем талантливее рассказчик, тем ярче и мы представляем словесные образы.
</p><br/>


                `,
              text: '<img  alt="Справка" src="./public/tasks/78.bmp"></img>',
            },
            {
              question: `
              <center>
              <div  style="background-color:white;margin: 8px;border-radius:20px;margin-bottom:20px">
             <center><strong><h >Вопрос 4.2</h></strong></center>
                  <image src="./public/tasks/79.bmp"></image>
</div></center>
                `,
              text: '<img  alt="Справка" src="./public/tasks/80.bmp"></img>',
            },
            {
              question: `
              <center>
              <div  style="background-color:white;margin: 8px;border-radius:20px;margin-bottom:20px">
              <center><strong><h >Вопрос 4.3</h></strong></center>
                  <img  alt="Справка" src="./public/tasks/81.bmp"></img>
</div></center>
                `,
              text: '<img  alt="Справка" src="./public/tasks/82.bmp"></img>',
            },
            {
              question: `
              <center>
              <div  style="background-color:white;margin: 8px;border-radius:20px;margin-bottom:20px">
             <center><strong><h >Вопрос 4.4</h></strong></center>
                  <img  alt="Справка" src="./public/tasks/83.bmp"></img>

</div></center>
                `,
              text: '<img  alt="Справка" src="./public/tasks/84.bmp"></img>',
            },
            {
              question: `
              <center>
              <div  style="background-color:white;margin: 8px;border-radius:20px;margin-bottom:20px">
              <center><strong><h >Вопрос 4.5</h></strong></center>
                  <img  alt="Справка" src="./public/tasks/85.bmp"></img>
</div></center>
                `,
              text: '<img  alt="Справка" src="./public/tasks/86.bmp"></img>',
            },
          ],
        },
        {
          subTasks: [
            {
              question: `
              <center>
              <div  style="background-color:white;margin: 8px;border-radius:20px;margin-bottom:20px">
              <center><strong><h >Вопрос 5 (номера из учебников для подготовки)</h></strong></center>
                  <image src="./public/tasks/87.bmp"></image></div></center>
                `,
              text: '<img  alt="Справка" src="./public/tasks/88.bmp"></img>',
            },
            {
              question: `
              <center>
              <div  style="background-color:white;margin: 8px;border-radius:20px;margin-bottom:20px">
                <center><strong><h >Вопрос 5.2</h></strong></center>
              <center><p>Расставьте знаки препинания. Укажите цифры, на месте которых должны стоять запятые.
<br/>
В раскопках под Новгородом(1) которые велись в продолжение десяти лет(2) были найдены сверхинтересные(3) берестяные грамоты(4) свидетельствующие о том(5) что восточные славяне обладали сравнительно высоким уровнем письма(6) подтверждая тем самым факт(7) что Русь была страной(8) высокой и прекрасной письменной культуры.</p></center>

                `,
              text: '<img  alt="Справка" src="./public/tasks/90.bmp"></img>',
            },
            {
              question: `
              <center>
              <div  style="background-color:white;margin: 8px;border-radius:20px;margin-bottom:20px">
                <center><strong><h >Вопрос 5.3</h></strong></center>
              <center><h >Расставьте знаки препинания. Укажите цифры, на месте которых должны стоять запятые.
<br/>За 75 лет(1) прошедших после гибели парохода «Челюскин»(2) и спасения всех (3)оказавшихся на льду людей(4) в печати появились десятки статей(5) легенд(6) фантастических и псевдонаучных публикаций(7) посвященных подготовке и ходу выполнения этого необычного (8)по тем временам рейса.</h></center>
                  </div></center>
                `,
              text: '<img  alt="Справка" src="./public/tasks/91.bmp"></img>',
            },
            {
              question: `
              <center>
              <div  style="background-color:white;margin: 8px;border-radius:20px;margin-bottom:20px">
                <center><strong><h >Вопрос 5.4</h></strong></center>
              <center><h >Расставьте знаки препинания. Укажите цифры, на месте которых должны стоять запятые.

XVIII век является временем (1) когда Россия «вздохнула» по-новому (2) ведь именно тогда (3) начали отстраиваться новые города и объекты (4) которые по сей день считаются историческими памятниками архитектуры. При этом первая половина XVIII века (5) тесно связана с именем великого российского императора Петра I. Именно он (6) привнёс много новшеств (7) заимствованных (8) из стран Европы.</h></center>
                  </div></center>
                `,
              text: '<img  alt="Справка" src="./public/tasks/92.bmp"></img>',
            },
            {
              question: `
              <center>
              <div  style="background-color:white;margin: 8px;border-radius:20px;margin-bottom:20px">
                <center><strong><h >Вопрос 5.5</h></strong></center>
              <center><h >Расставьте знаки препинания. Укажите цифры, на месте которых должны стоять запятые.
<br/>Слышалось иногда(1) как густым басом(2) гудит(3) пролетая где-то очень близко(4) невидимый жук(5) и как он(6) сухо шлепнувшись(7) о какое-то препятствие(8) сразу замолкает.</h></center>
                 </div></center>
                `,
              text: '<img  alt="Справка" src="./public/tasks/93.bmp"></img>',
            },
          ],
        },
        {
          subTasks: [
            {
              question: `
              <center>
              <div  style="background-color:white;margin: 8px;border-radius:20px;margin-bottom:20px">
              <center><strong><h >Вопрос 6 (номера из учебников для подготовки)</h></strong></center>
                  <p >Укажите варианты ответов, в которых дано верное объяснение написания выделенного слова. Запишите номера этих ответов.
<br/>
1)  ВСПОМНИТЬ  — на конце приставки перед буквой, обозначающей глухой согласный звук, пишется буква С.<br/>
<br/>
2)  НАСТРОЕННЫЙ (на радиоволну)  — в суффиксе -ЕНН- прилагательного пишется -НН-.<br/>
<br
3)  УЛОЖИТЬ (спать)  — написание безударной чередующейся гласной в корне слова зависит от ударения.<br/>
<br/>
4)  (русская) ПЕЧЬ  — в существительных III склонения после шипящего буква Ь пишется.
<br/>
5)  (осталось) ПОЛЧАСА  — слова с ПОЛ- всегда пишутся слитно.</p><br/>



</div></center>
                `,
              text: " 14.",
            },
            {
              question: `
              <center>
              <div  style="background-color:white;margin: 8px;border-radius:20px;margin-bottom:20px">
              <center><strong><h >Вопрос 6.2</h></strong></center>
                  <p >Укажите варианты ответов, в которых дано верное объяснение написания выделенного слова. Запишите номера этих ответов.
<br/>
1)  (знания) УСВОЕНЫ  — в суффиксе краткого страдательного причастия прошедшего времени пишется одна буква Н.
<br/>
2)  ГОРЯЧО (благодарить)  — в окончании наречий после шипящих под ударением пишется буква О.
<br/>
3)  УКРОЩАТЬ (животных)  — в корне слова пишется непроверяемая гласная.
<br/>
4)  НЕНАСТНЫЙ  — непроизносимый согласный в корне слова проверяется словом ненастье, в котором он слышится отчётливо.
<br/>
5)  БЕЗЫМЯННЫЙ  — после русской приставки, оканчивающейся на согласный, пишется буква Ы.</p><br/>
<br/>
</div></center>
                `,
              text: " 145.",
            },
            {
              question: `
              <center>
              <div  style="background-color:white;margin: 8px;border-radius:20px;margin-bottom:20px">
              <center><strong><h >Вопрос 6.3</h></strong></center>
                  <p >Укажите варианты ответов, в которых дано верное объяснение написания выделенного слова. Запишите номера этих ответов.
<br/>
1)  БЕЗЗАКОННЫЙ  — сочетание букв -зз- пишется на стыке приставки и корня.
<br/>
2)  НЕСКОЛЬКО  — в неопределённом местоимении в безударной позиции пишется приставка НЕ-.
<br/>
3)  НЕПРАВДА  — имя существительное пишется с НЕ слитно, потому что слово не употребляется без НЕ.
<br/>
4)  ПОЛ-ОСТРОВА  — слово пишется через дефис, потому что после пол- стоит гласная буква.
<br/>
5)  БЛЕДНО-ЖЁЛТЫЙ  — сложные имена прилагательные, которые обозначают оттенки цвета, пишутся через дефис.</p><br/>
<br/>
</div></center>
                `,
              text: " 145.",
            },
            {
              question: `
              <center>
              <div  style="background-color:white;margin: 8px;border-radius:20px;margin-bottom:20px">
              <center><strong><h >Вопрос 6.4</h></strong></center>
                  <p >Укажите варианты ответов, в которых дано верное объяснение написания выделенного слова. Запишите номера этих ответов.
<br/>
1)  ПРИБИТЬ (к стене)  — приставка ПРИ- неизменяемая.
<br/>
2)  ДВАДЦАТИПЯТИМЕТРОВЫЙ  — прилагательные, первая часть которых  — числительное, пишутся слитно.
<br/>
3)  ОТРАСЛЬ (животноводства)  — написание безударной гласной в корне слова объясняется исключением из правила о чередующихся корнях.
<br/>
4)  КОЖАНАЯ (куртка)  — в отглагольном прилагательном пишется -Н-.
<br/>
5)  НЕРЯШЛИВО (одетый)  — НЕ- пишется слитно с наречиями, если его можно заменить синонимом без НЕ.</p><br/>
<br/>
</div></center>
                `,
              text: " 23|32.",
            },
            {
              question: `
              <center>
              <div  style="background-color:white;margin: 8px;border-radius:20px;margin-bottom:20px">
              <center><strong><h >Вопрос 6.5</h></strong></center>
                  <p >Укажите варианты ответов, в которых дано верное объяснение написания выделенного слова. Запишите номера этих ответов.
<br/>
1)  ПРЕОДОЛЕТЬ  — приставка ПРЕ- пишется в значении ПЕРЕ-.
<br/>
2)  ЖАЛОБНО (петь)  — в суффиксах наречий пишется -Н-.
<br/>
3)  (с) ЗАМИРАНИЕМ (сердца)  — написание безударной чередующейся гласной в корне слова зависит от суффикса.
<br/>
4)  (детский) ПЛАЧ  — на конце имен существительных мужского рода 2-го склонения после шипящего буква Ь не пишется.
<br/>
5)  (работать) НЕ БУДУ  — с приставкой НЕ- глаголы всегда пишутся раздельно.</p><br/>
<br/>
</div></center>
                `,
              text: " 134.",
            },
          ],
        },
        {
          subTasks: [
            {
              question: `
              <center>
              <div  style="background-color:white;margin: 8px;border-radius:20px;margin-bottom:20px">
              <center><strong><h >Вопрос 7 (номера из учебников для подготовки)</h></strong></center>
                  <center><img  alt="Справка" src="./public/tasks/94.bmp"></img></center>

</div></center>
                `,
              text:
                '<center><img  alt="Справка" src="./public/tasks/95.bmp"></img></center>',
            },
            {
              question: `
              <center>
              <div  style="background-color:white;margin: 8px;border-radius:20px;margin-bottom:20px">
              <center><strong><h >Вопрос 7.2</h></strong></center>
                  <center><img  alt="Справка" src="./public/tasks/96.bmp"></img></center>

</div></center>
                `,
              text: '<img  alt="Справка" src="./public/tasks/97.bmp"></img>',
            },
            {
              question: `
              <center>
              <div  style="background-color:white;margin: 8px;border-radius:20px;margin-bottom:20px">
              <center><strong><h >Вопрос 7.3</h></strong></center>
                 <center><img  alt="Справка" src="./public/tasks/98.bmp"></img></center>

</div></center>
                `,
              text: '<img  alt="Справка" src="./public/tasks/99.bmp"></img>',
            },
            {
              question: `
              <center>
              <div  style="background-color:white;margin: 8px;border-radius:20px;margin-bottom:20px">
              <center><strong><h >Вопрос 7.4</h></strong></center>
                 <center><img  alt="Справка" src="./public/tasks/100.bmp"></img></center>

</div></center>
                `,
              text: '<img  alt="Справка" src="./public/tasks/101.bmp"></img>',
            },
            {
              question: `
              <center>
              <div  style="background-color:white;margin: 8px;border-radius:20px;margin-bottom:20px">
              <center><strong><h >Вопрос 7.5</h></strong></center>
                  <center><img  alt="Справка" src="./public/tasks/102.bmp"></img></center>

</div></center>
                `,
              text: '<img  alt="Справка" src="./public/tasks/103.bmp"></img>',
            },
          ],
        },
        {
          subTasks: [
            {
              question: `
              <center>
              <div  style="background-color:white;margin: 8px;border-radius:20px;margin-bottom:20px">
              <center><strong><h >Вопрос 8 (номера из учебников для подготовки)</h></strong></center>
                  <p >Раскройте скобки и запишите слово «яблоко» в соответствующей форме, соблюдая нормы современного русского литературного языка.
<br/>
Хороший урожай (яблоко) порадовал и фермеров, и торговцев.</p><br/>
</div></center>
                `,
              text: " яблок.",
            },
            {
              question: `
              <center>
              <div  style="background-color:white;margin: 8px;border-radius:20px;margin-bottom:20px">
              <center><strong><h >Вопрос 8.2</h></strong></center>
                  <p >Раскройте скобки и запишите слово «гулянья» в соответствующей форме, соблюдая нормы современного русского литературного языка.

 <br/>

Мне памятны звуки народных (гулянья) на улицах старой Москвы.</p><br/>
</div></center>
                `,
              text: " гуляний.",
            },
            {
              question: `
              <center>
              <div  style="background-color:white;margin: 8px;border-radius:20px;margin-bottom:20px">
              <center><strong><h >Вопрос 8.3</h></strong></center>
                  <p >Раскройте скобки и запишите слово «тюль» в соответствующей форме, соблюдая нормы современного русского литературного языка.
<br/>
Завесить окна (тюль) вместо тяжёлых штор оказалось отличной идей, комната тут же преобразилась.</p><br/>

</div></center>
                `,
              text: " тюлем.",
            },
            {
              question: `
              <center>
              <div  style="background-color:white;margin: 8px;border-radius:20px;margin-bottom:20px">
              <center><strong><h >Вопрос 8.4</h></strong></center>
                  <p >Раскройте скобки и запишите слово «абрикосы» в соответствующей форме, соблюдая нормы современного русского литературного языка.

 <br/>

Для приготовления десерта понадобится банка консервированных (абрикосы).</p><br/>
</div></center>
                `,
              text: " абрикосов.",
            },
            {
              question: `
              <center>
              <div  style="background-color:white;margin: 8px;border-radius:20px;margin-bottom:20px">
              <center><strong><h >Вопрос 8.5</h></strong></center>
                  <p >Раскройте скобки и запишите слово «триста» в соответствующей форме, соблюдая нормы современного русского литературного языка.

 <br/>

С (триста) заявлениями нужно будет разобраться в течение двух недель.</p><br/>

</div></center>
                `,
              text: " тремястами.",
            },
          ],
        },
        {
          subTasks: [
            {
              question: `
              <center>
              <div  style="background-color:white;margin: 8px;border-radius:20px;margin-bottom:20px">
              <center><strong><h >Вопрос 9 (номера из учебников для подготовки)</h></strong></center>
                  <p >Замените словосочетание «юношеское сердце», построенное на основе согласования, синонимичным словосочетанием со связью «управление».

Напишите получившееся словосочетание.</p><br/>

</div></center>
                `,
              text: " сердце юноши.",
            },
            {
              question: `
              <center>
              <div  style="background-color:white;margin: 8px;border-radius:20px;margin-bottom:20px">
              <center><strong><h >Вопрос 9.2</h></strong></center>
                  <p >Замените словосочетание «солдатские могилы», построенное на основе согласования, синонимичным словосочетанием со связью управление. Напишите получившееся словосочетание.</p><br/>

</div></center>
                `,
              text: " могилы солдат.",
            },
            {
              question: `
              <center>
              <div  style="background-color:white;margin: 8px;border-radius:20px;margin-bottom:20px">
              <center><strong><h >Вопрос 9.3</h></strong></center>
                  <p >Замените словосочетание «в водяных дорожках», построенное на основе согласования, синонимичным словосочетанием со связью управление. Напишите получившееся словосочетание.</p><br/>

</div></center>
                `,
              text: " в дорожках из воды|в дорожках воды.",
            },
            {
              question: `
              <center>
              <div  style="background-color:white;margin: 8px;border-radius:20px;margin-bottom:20px">
              <center><strong><h >Вопрос 9.4</h></strong></center>
                  <p >Замените словосочетание «печной дым», построенное на основе согласования, синонимичным словосочетанием со связью управление. Напишите получившееся словосочетание.</p><br/>

</div></center>
                `,
              text: " дым печи или дым из печи.",
            },
            {
              question: `
              <center>
              <div  style="background-color:white;margin: 8px;border-radius:20px;margin-bottom:20px">
              <center><strong><h >Вопрос 9.5</h></strong></center>
                  <p >Замените словосочетание «кожаная сумка», построенное на основе согласования, синонимичным словосочетанием со связью управление. Напишите получившееся словосочетание.

</p><br/>
 
</div></center>
                `,
              text: " сумка из кожи.",
            },
          ],
        },
        {
          subTasks: [
            {
              question: `
              <center>
              <div  style="background-color:white;margin: 8px;border-radius:20px;margin-bottom:20px">
              <center><strong><h >Вопрос 12 (номера из учебников для подготовки)</h></strong></center>
                  <p >Укажите варианты ответов, в которых средством выразительности речи является фразеологизм.

 <br/>

1)  На даче, в двух шагах от застеклённой веранды, висит удобный, глубокий гамак, в который так хочется поскорее залезть, что он мне снится по ночам  — в виде сказочной ладьи, плывущей над сосновым лесом.
<br/>
2)  А ещё на даче имеется сердитый медный самовар. Он кормится шишками и очень недоволен, когда их мало.
<br/>
3)  И у нас начинается развесёлая возня, беготня по комнате и швыряние подушек до тех пор, пока мама решительно не прекращает этот шум, который может потревожить соседей.
<br/>
4)  Я часто так от него прячусь, а он очень пугается и драматическим голосом взывает к несуществующей публике…
<br/>
5)  Она наклоняется, берёт платьице, перебирает его руками, а сама смотрит куда-то в сторону, в одну точку, и лицо у нее напряжённое и печальное, что мне становится не по себе.</p><br/>
<br/>
</image></div></center>
                `,
              text: " 15.",
            },
            {
              question: `
              <center>
              <div  style="background-color:white;margin: 8px;border-radius:20px;margin-bottom:20px">
              <center><strong><h >Вопрос 12.2</h></strong></center>
                  <p >Укажите варианты ответов, в которых средством выразительности речи является эпитет.

 
<br/>
1)  Я тотчас потянулся к сабле, потом поиграл рюмкой, а до прочего не хотелось дотрагиваться.
<br/>
2)  Рассказывая мне впоследствии об этой сценке, отец смеялся…
<br/>
3)  Моё страстное увлечение придавало мне вес в глазах мальчишек и вызывало их зависть...
<br/>
4)  Словом, прижился в военной среде, приобретя приятелей среди офицерства, а ещё более  — среди солдат.
<br/>
5)  Во всяком случае, когда я окончил училище, хотя высокие баллы по математическим предметам сулили лёгкую возможность поступления в любое высшее техническое заведение, об этом и речи не было.</p><br/>
<br/>
</div></center>
                `,
              text: " 35.",
            },
            {
              question: `
              <center>
              <div  style="background-color:white;margin: 8px;border-radius:20px;margin-bottom:20px">
              <center><strong><h >Вопрос 12.3</h></strong></center>
                  <p >Укажите варианты ответов, в которых средством выразительности является фразеологизм.
<br/>
1)  Наша драгоценная дружба едва не рухнула в первый же школьный день.
<br/>
2)  А затем со слезами Митя требовал вернуть ему былое доверие ради святой дружбы, что «больше нас самих», и пытался влепить мне иудин поцелуй.
<br/>
3)  Митина вздорность, перепады настроений, чувствительные разговоры, всегдашняя готовность к ссоре, проявляющаяся при первой же возможности, стали казаться мне непременной принадлежностью дружбы.
<br/>
4)  Митя был жителем нашего дома, но недавно его родители поменяли квартиру.
<br
5)  Но Митя не только внешне походил на девочку  — слабодушный, чувствительный, слезливый, хотя и способный к истерическим вспышкам ярости, и на него рука не поднималась.</p><br/>
<br/>
</div></center>
                `,
              text: " 25.",
            },
            {
              question: `
              <center>
              <div  style="background-color:white;margin: 8px;border-radius:20px;margin-bottom:20px">
              <center><strong><h >Вопрос 12.4</h></strong></center>
                  <p >Укажите варианты ответов, в которых средством выразительности речи является эпитет.
<br/>
1)  Сердце у меня за неё болит.
<br/>
2)  И зимой в лютый мороз с ними до темноты гуляет.
<br/>
3)  Они стали всюду заявления строчить, будто они о правах строителей беспокоятся.
<br/>
4)  Это просто дикая несправедливость.
<br/>
5)  Они сами такие люди, которые за себя не попросят и никаких бумажек собирать не станут.</p><br/>
<br/>
</div></center>
                `,
              text: " 24|42",
            },
            {
              question: `
              <center>
              <div  style="background-color:white;margin: 8px;border-radius:20px;margin-bottom:20px">
              <center><strong><h >Вопрос 12.5</h></strong></center>
                  <p >Укажите варианты ответов, в которых средством выразительности речи является сравнение.

 
<br/>
1)  Гнетущие и безрадостные события в её жизни отдавались постоянной болью в сердце, окрасили мрачными тонами всё её существование.
<br/>
2)  Она ходила в театры, и там почти в каждой опере, в каждом балете была жизненная драма.
<br/>
3)  Музыка звёзд, музыка вечной жизни, как свет, возникла где-то в глубинах мироздания.
<br/>
4)  И вдруг купол над ней зацвёл звёздами, и откуда-то с высот, нарастая, ширясь и крепчая, полилась музыка.
<br/>
5)  Музыка словно разлилась по всему небу, она достигла самой далёкой звезды и грянула на весь необъятный поднебесный мир.</p><br/>
<br/>
</div></center>
                `,
              text: " 3",
            },
          ],
        },
      ],
      currentTask: null,
      showAnswer: [], // Массив для отслеживания видимости ответов
    };
  },

  methods: {
    showTask(taskIndex) {
      this.currentTask = taskIndex;
    },
    toggleAnswer(taskIndex, subTaskIndex) {
      this.showAnswer[taskIndex][subTaskIndex] = !this.showAnswer[taskIndex][
        subTaskIndex
      ];
    },
  },
};
</script>
<script setup>
import { onMounted } from "vue";

function handleKeydown(event) {
  if (event.key === "Escape") {
    window.location.href = "/#/Rusiaz";
  }
}

onMounted(() => {
  document.addEventListener("keydown", handleKeydown);
});
</script>

<style >
p {
  color: black;
}
h {
  color: black !important;
}
a {
  color: rgb(255, 255, 255) !important;
}

.circle-button {
  margin: 10px !important;
  width: 40px;
  height: 40px;
  border-radius: 50%;
  background-color: rgb(138, 43, 226);
  border: 1px solid white;
}
.sticky-ad {
  margin: 5px;
}
.question-box {
  background-color: white;
  border-radius: 20px;
  width: 90%;
  max-width: 700px;
  padding: 10px;
}
.answer {
  background-color: white;
  padding: 10px;
  border: 1px solid white;
  border-radius: 20px;
  color: black;
}

.answer-text {
  color: black !important;
}
.toggle-button {
  margin: 10px;
  padding: 10px 20px;
  border-radius: 20px;
  color: white;
  border-width: 1.5px;
}
.toggle-button.show {
  background-color: green;
  border-color: black;
}
.toggle-button.hide {
  background-color: #d41613;
}
.circle-button:hover {
  border: 0.5px solid white;
  background-color: #b752ff !important;
}
@media screen and (max-width: 768px) {
  .question-box {
    width: 100%;
  }
  .circle-button {
    width: 50px;
    height: 50px;
  }
  .toggle-button {
    width: 100%;
    padding: 15px;
  }
}
button:hover {
  /* Стиль при наведении курсора */
  border: 1px solid white !important;
}

</style>
<style scoped>*{
  margin: 1px;
}</style>